docs/kaur-2016-introd-fuzzy.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-04-30 Sun 15:41 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Alexander Brown" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="preamble" class="status">
<nav><a href="index.html">Home</a> | <a href="blog.html">Blog</a> | <a href="notes.html">Notes</a> | <a href="class.html">Classes</a> | <a href="projects.html">Projects</a> | <a href="todo.html">Todo</a> | <a href="error.html">About</a></nav>
</div>
<div id="content" class="content">
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgad9d4c7">1. An introduction to fuzzy linear programming problems, Kaur, J., &amp; Kumar, A., , (2016)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="book">book</span></span></a></li>
<li><a href="#orgc23e038">2. Notes</a>
<ul>
<li><a href="#orga1d700c">2.1. Abstract</a></li>
<li><a href="#org9c9483a">2.2. State of the Art</a></li>
<li><a href="#org96c85a1">2.3. Chapter 5</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<div id="outline-container-orgad9d4c7" class="outline-2">
<h2 id="orgad9d4c7"><span class="section-number-2">1.</span> An introduction to fuzzy linear programming problems, Kaur, J., &amp; Kumar, A., , (2016)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="book">book</span></span></h2>
<div class="outline-text-2" id="text-1">
<p>
See <a href="&amp;kaur-2016-introd-fuzzy">&amp;kaur-2016-introd-fuzzy</a>
</p>
</div>
</div>

<div id="outline-container-orgc23e038" class="outline-2">
<h2 id="orgc23e038"><span class="section-number-2">2.</span> Notes</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orga1d700c" class="outline-3">
<h3 id="orga1d700c"><span class="section-number-3">2.1.</span> Abstract</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Optimization is a kind of decision making in which decisions have to be taken to optimize one or more objectives under some prescribed set of circumstances. The problems that often arise as a result of mathematical modeling of many real-life situations are called optimization problems.</li>
<li>Over the past several decades optimization models have been primarily developed in a deterministic, crisp environment. In such models the objectives and constraints are formulated in a ‘hard’ crisp manner leaving no scope for uncertainty and vagueness. However, in real-life situations there may exist uncertainty. In such situations it is practical to develop mathematical models of the realistic problem in a fuzzy environment and the optimization problem under consideration becomes a fuzzy programming problem.</li>
</ul>
</div>
</div>

<div id="outline-container-org9c9483a" class="outline-3">
<h3 id="org9c9483a"><span class="section-number-3">2.2.</span> State of the Art</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Linear programming is a quantitative tool for an optimal allocation of limited resources amongst competing activities. It is perhaps the most popular operations research technique with applications in several functional areas of business such as production, finance, marketing, distribution, advertising and so forth [1–4].</li>
<li>The conventional linear programming deals with crisp parameters. However, in most of the real world applications, the nature of the parameters of the decision making problems is generally imprecise.</li>
<li>Uncertainties can lead to increased complexities in the related optimization efforts. Simply ignoring these uncertainties is considered undesired as it may result in inferior or wrong decisions [6–8]. Therefore, inexact linear programming methods are desired under uncertainty.</li>
<li>In the past decades, a large number of inexact linear programming methods have been developed to deal with various uncertainties namely stochastic, interval and fuzzy linear programming [5, 7, 9–36].
<ul class="org-ul">
<li>Stochastic linear programming, derived from probability theory, could deal with various probabilistic uncertainties; however, the increased data requirements for specifying the parameters’ probability distributions might affect their practical applicability [37].</li>
<li>Interval linear programming, based on interval analysis, was proved to be an effective approach in dealing with uncertainties. Interval linear programming did not require distributional information and would not lead to complicated intermediate models. However, it was to be noted that the outputs of Interval linear programming were with lower and upper bounds, and thus could not reflect the distribution of uncertainty within the lower and upper bounds [38].</li>
</ul></li>
<li>The following are a few good reasons for FLP
<ul class="org-ul">
<li>Fuzzy sets theory and the related possibility theory, which were designed to supplement the interpretation of linguistic or measured uncertainties for real-world random phenomena, provided powerful tools for dealing with imprecise information [39].</li>
<li>Although fuzziness offered a weaker (less informative) indication of uncertainty than randomness, fuzzy sets theory and possibility theory did not require sufficient precise data to quantify imprecise information. Furthermore, fuzzy sets were more  accurate than interval numbers, and reflected more detailed information for system uncertainties.</li>
<li>Fuzzy set theory has been extensively employed in linear programming. The main objective in fuzzy linear programming is to find the best solution possible with imprecise, vague, uncertain or incomplete information. There are many sources of imprecision in fuzzy linear programming. The sources of imprecision in fuzzy linear programming vary. For example, sometimes constraint satisfaction limits are vague and other times coefficient variables are not known precisely.</li>
</ul></li>
<li>Zimmermann [41] introduced the first formulation of fuzzy linear programming to address the impreciseness and vagueness of the parameters in linear programming problems with fuzzy constraints and objective functions.</li>
<li>Good for literature review *A detailed review and classification of fuzzy linear programs and their solution</li>
</ul>
<p>
approaches can be found in Baykasoglu and Gocken [47].
</p>
<ul class="org-ul">
<li>In fact, decision variables of a fuzzy linear programming problem where all of the parameters are stated as fuzzy should also be considered as fuzzy numbers. Because, the fuzzy characteristic of the decision may be partially lost and the decision making process is limited with the crisp solutions when the decision variables oh is problem are crisp [11]. For this reason, instead of crisp solutions, obtaining fuzzy efficient solutions which provide ranges of flexibility to decision maker(s) seems more impressive in fully uncertain environments [17]. In other words, presenting the reasonable range of values for the decision variables can be comparatively better</li>
</ul>
<p>
than the currently available crisp solutions [34].
</p>
<ul class="org-ul">
<li>In addition, fuzzy solutions may serve the regions containing potential satisfactory solutions around the optimal solutions to the decision maker(s). Thus, the final decisions can be made by the decision maker(s) as crisp ones. By taking the decision variables as fuzzy, the choice of the crisp decisions among the fuzzy solutions will also be supported [49].</li>
<li>Fully fuzzy linear programming problems have been an attractive topic for the researchers in recent years. However, the literature on fully fuzzy linear programming is not rich as there are a few studies available on this research topic.</li>
<li>Buckley and Feuring [9] proposed a solution method for fully fuzzy linear programming problems. All of the parameters and decision variables are defined as triangular fuzzy numbers. The fuzzy linear programming problem is transformed into a multi-objective fuzzy linear programming problem</li>
<li>A fully fuzzy linear programming problem was transformed into the two crisp linear problems by Lotfi et al. [33] that are maximization problem for the core and minimization problem for the margin. The proposed method is not an exact one, just an approximation technique since it relies on the approximation of the fuzzy numbers to the nearest symmetric triangular fuzzy numbers</li>
</ul>
</div>
</div>

<div id="outline-container-org96c85a1" class="outline-3">
<h3 id="org96c85a1"><span class="section-number-3">2.3.</span> Chapter 5</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Good stuff there
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alexander Brown</p>
<p class="date">Created: 2023-04-30 Sun 15:41</p>
</div>
</body>
</html>
